; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-3-1-247)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p0-2 - location
	p1-0 - location
	p1-2 - location
	p2-3 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s3)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s0)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s0)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s2)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 17)
	(= (time-to-walk p0-2 s0) 17)
	(= (time-to-walk s2 p0-2) 11)
	(= (time-to-walk p0-2 s2) 11)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 33)
	(= (time-to-walk p1-0 s1) 33)
	(= (time-to-walk s0 p1-0) 15)
	(= (time-to-walk p1-0 s0) 15)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 17)
	(= (time-to-walk p1-2 s1) 17)
	(= (time-to-walk s2 p1-2) 35)
	(= (time-to-walk p1-2 s2) 35)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 26)
	(= (time-to-walk p2-3 s2) 26)
	(= (time-to-walk s3 p2-3) 23)
	(= (time-to-walk p2-3 s3) 23)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 11)
	(= (time-to-drive s0 s2) 11)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 39)
	(= (time-to-drive s2 s3) 39)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 52)
	(= (time-to-drive s1 s0) 52)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 11)
	(= (time-to-drive s3 s0) 11)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 5)
	(= (time-to-drive s3 s1) 5)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s1)
	(at truck1 s2)
	(at truck2 s1)
	(at package1 s3)
	))

(:metric minimize (+ (* 1 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (walk driver1 s2 p0-2)
   deleted: (at driver1 s2)
   added: (at driver1 p0-2)
   goals met: 0 of 4
2. (walk driver2 s2 p1-2)
   deleted: (at driver2 s2)
   added: (at driver2 p1-2)
   goals met: 0 of 4
3. (walk driver2 p1-2 s1)
   deleted: (at driver2 p1-2)
   added: (at driver2 s1)
   goals met: 1 of 4
4. (board-truck driver2 truck1 s1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 0 of 4
5. (drive-truck truck1 s1 s3 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (fuel-used) from 0 to 50
   goals met: 0 of 4
6. (walk driver1 p0-2 s0)
   deleted: (at driver1 p0-2)
   added: (at driver1 s0)
   goals met: 0 of 4
7. (drive-truck truck1 s3 s2 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (fuel-used) from 50 to 440
   goals met: 1 of 4
8. (board-truck driver1 truck2 s0)
   deleted: (at driver1 s0) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 1 of 4
9. (drive-truck truck2 s0 s1 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 440 to 960
   goals met: 2 of 4
10. (load-truck package1 truck1 s2)
   deleted: (at package1 s2)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 2 of 4
11. (drive-truck truck1 s2 s3 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (fuel-used) from 960 to 1389
   goals met: 1 of 4
12. (unload-truck package1 truck1 s3)
   deleted: (in package1 truck1)
   added: (at package1 s3)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 2 of 4
13. (drive-truck truck1 s3 s1 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (fuel-used) from 1389 to 1439
   goals met: 2 of 4
14. (disembark-truck driver2 truck1 s1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 3 of 4
15. (disembark-truck driver1 truck2 s1)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 3 of 4
16. (board-truck driver2 truck1 s1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 2 of 4
17. (drive-truck truck1 s1 s3 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (fuel-used) from 1439 to 1489
   goals met: 2 of 4
18. (drive-truck truck1 s3 s2 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (fuel-used) from 1489 to 1879
   goals met: 3 of 4
19. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 3 of 4
20. (walk driver2 s2 p1-2)
   deleted: (at driver2 s2)
   added: (at driver2 p1-2)
   goals met: 3 of 4
21. (walk driver2 p1-2 s1)
   deleted: (at driver2 p1-2)
   added: (at driver2 s1)
   goals met: 4 of 4
